/////////////// user_config.c ///////////////
/////////////// @INFO:#TIPS  ///////////////

#include "stdint.h"

const char kw_string2[5][30] = {
    "天猫精灵",
    "小艾小艾",
    "小义小义",
    "你好小义",
    "你好小艾",
};

const int16_t NUM_WW = 4;
const int32_t WAKE_STEPS = 32767;
const int16_t WW_TRG_MODE[] = {
    -10000,
    -10000,
    -10000,
    -10000,
    -10000,
};
const int16_t KW_TRG_MODE[] = {
    -10000,
    -10000,
    -10000,
    -10000,
    -10000,
};


/*==============  Reference threshold  ================*/
#if 0
/*==============FP/h:30.0 all confidence ================*/
const int16_t kw_thres_1[5] = {
    -10000,
    -10000,
    -10000,
    -10000,
    -10000,
};
/*==============FP/h:20.0 all confidence ================*/
const int16_t kw_thres_2[5] = {
    -10000,
    -10000,
    -10000,
    -10000,
    -10000,
};
/*==============FP/h:10.0 all confidence ================*/
const int16_t kw_thres_3[5] = {
    -10000,
    -10000,
    -10000,
    -10000,
    -10000,
};
/*==============FP/h:5.0 all confidence ================*/
const int16_t kw_thres_4[5] = {
    -10000,
    -10000,
    -10000,
    -10000,
    -10000,
};
/*==============FP/h:2.0 all confidence ================*/
const int16_t kw_thres_5[5] = {
    -10000,
    -10000,
    -10000,
    -10000,
    -10000,
};
/*==============FP/h:1.0 all confidence ================*/
const int16_t kw_thres_6[5] = {
    -10000,
    -10000,
    -10000,
    -10000,
    -10000,
};
/*==============FP/h:0.5 all confidence ================*/
const int16_t kw_thres_7[5] = {
    -10000,
    -10000,
    -10000,
    -10000,
    -10000,
};
/*==============FP/h:0.1 all confidence ================*/
const int16_t kw_thres_8[5] = {
    -10000,
    -10000,
    -10000,
    -10000,
    -10000,
};
#endif
